In [1]:
import numpy as np

In [2]:
import pandas as pd

In [5]:
s = pd.Series([1, 3, 4, np.nan, 6, 8])

In [6]:
s

0    1.0
1    3.0
2    4.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [7]:
dates = pd.date_range('20130101', periods=6)

In [8]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [9]:
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list('ABCD')); df

                   A         B         C         D
2013-01-01 -0.102421 -0.258090  2.036218 -0.299248
2013-01-02  0.286185  0.612552 -1.974256  0.290884
2013-01-03  0.256183 -0.606892 -0.554919 -0.595412
2013-01-04 -0.249368 -1.181939  0.086883  0.810661
2013-01-05 -0.711488  1.877233  1.588882 -0.188466
2013-01-06  2.520897 -0.199519 -0.487125  1.317761

In [10]:
df2 = pd.DataFrame({'A': 1.,
                     'B': pd.Timestamp('20130102'),
                     'C': pd.Series(1, index=list(range(4)), dtype='float32'),
                     'D': np.array([3] * 4, dtype='int32'),
                     'E': pd.Categorical(["test", "train", "test", "train"]),
                     'F': 'foo'})

In [11]:
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [12]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [15]:
df.head()

                   A         B         C         D
2013-01-01 -0.102421 -0.258090  2.036218 -0.299248
2013-01-02  0.286185  0.612552 -1.974256  0.290884
2013-01-03  0.256183 -0.606892 -0.554919 -0.595412
2013-01-04 -0.249368 -1.181939  0.086883  0.810661
2013-01-05 -0.711488  1.877233  1.588882 -0.188466

In [16]:
df.tail()

                   A         B         C         D
2013-01-02  0.286185  0.612552 -1.974256  0.290884
2013-01-03  0.256183 -0.606892 -0.554919 -0.595412
2013-01-04 -0.249368 -1.181939  0.086883  0.810661
2013-01-05 -0.711488  1.877233  1.588882 -0.188466
2013-01-06  2.520897 -0.199519 -0.487125  1.317761

In [17]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [18]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [19]:
df.to_numpy()

array([[-0.10242113, -0.25808951,  2.03621779, -0.29924767],
       [ 0.28618538,  0.61255151, -1.97425609,  0.29088377],
       [ 0.25618255, -0.60689158, -0.5549192 , -0.59541196],
       [-0.24936846, -1.18193868,  0.08688279,  0.81066063],
       [-0.71148796,  1.87723327,  1.5888823 , -0.18846621],
       [ 2.52089661, -0.19951867, -0.4871248 ,  1.31776148]])

In [20]:
df2.to_numpy()

array([[1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo']],
      dtype=object)

In [21]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.333331  0.040558  0.115947  0.222697
std    1.132668  1.073412  1.485970  0.729425
min   -0.711488 -1.181939 -1.974256 -0.595412
25%   -0.212632 -0.519691 -0.537971 -0.271552
50%    0.076881 -0.228804 -0.200121  0.051209
75%    0.278685  0.409534  1.213382  0.680716
max    2.520897  1.877233  2.036218  1.317761

In [22]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A   -0.102421    0.286185    0.256183   -0.249368   -0.711488    2.520897
B   -0.258090    0.612552   -0.606892   -1.181939    1.877233   -0.199519
C    2.036218   -1.974256   -0.554919    0.086883    1.588882   -0.487125
D   -0.299248    0.290884   -0.595412    0.810661   -0.188466    1.317761

In [23]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01 -0.299248  2.036218 -0.258090 -0.102421
2013-01-02  0.290884 -1.974256  0.612552  0.286185
2013-01-03 -0.595412 -0.554919 -0.606892  0.256183
2013-01-04  0.810661  0.086883 -1.181939 -0.249368
2013-01-05 -0.188466  1.588882  1.877233 -0.711488
2013-01-06  1.317761 -0.487125 -0.199519  2.520897

In [24]:
df.sort_values(by='B')

                   A         B         C         D
2013-01-04 -0.249368 -1.181939  0.086883  0.810661
2013-01-03  0.256183 -0.606892 -0.554919 -0.595412
2013-01-01 -0.102421 -0.258090  2.036218 -0.299248
2013-01-06  2.520897 -0.199519 -0.487125  1.317761
2013-01-02  0.286185  0.612552 -1.974256  0.290884
2013-01-05 -0.711488  1.877233  1.588882 -0.188466

In [25]:
df['A']

2013-01-01   -0.102421
2013-01-02    0.286185
2013-01-03    0.256183
2013-01-04   -0.249368
2013-01-05   -0.711488
2013-01-06    2.520897
Freq: D, Name: A, dtype: float64

In [26]:
df[0:3]

                   A         B         C         D
2013-01-01 -0.102421 -0.258090  2.036218 -0.299248
2013-01-02  0.286185  0.612552 -1.974256  0.290884
2013-01-03  0.256183 -0.606892 -0.554919 -0.595412

In [27]:
df[0:1]

                   A        B         C         D
2013-01-01 -0.102421 -0.25809  2.036218 -0.299248

In [28]:
df['20130102':'20130104']

                   A         B         C         D
2013-01-02  0.286185  0.612552 -1.974256  0.290884
2013-01-03  0.256183 -0.606892 -0.554919 -0.595412
2013-01-04 -0.249368 -1.181939  0.086883  0.810661

In [30]:
df.loc[dates[0]]

A   -0.102421
B   -0.258090
C    2.036218
D   -0.299248
Name: 2013-01-01 00:00:00, dtype: float64

In [31]:
df.loc[:, ['A', 'B']]

                   A         B
2013-01-01 -0.102421 -0.258090
2013-01-02  0.286185  0.612552
2013-01-03  0.256183 -0.606892
2013-01-04 -0.249368 -1.181939
2013-01-05 -0.711488  1.877233
2013-01-06  2.520897 -0.199519

In [32]:
df.loc['20130102':'20130104', ['A', 'B']]

                   A         B
2013-01-02  0.286185  0.612552
2013-01-03  0.256183 -0.606892
2013-01-04 -0.249368 -1.181939

In [33]:
df.loc['20130102', ['A', 'B']]

A    0.286185
B    0.612552
Name: 2013-01-02 00:00:00, dtype: float64

In [34]:
df.loc[dates[0], 'A']

-0.10242113418933736

In [35]:
df.at[dates[0], 'A']

-0.10242113418933736

In [36]:
df.iloc[3]

A   -0.249368
B   -1.181939
C    0.086883
D    0.810661
Name: 2013-01-04 00:00:00, dtype: float64

In [37]:
df.iloc[3:5, 0:2]

                   A         B
2013-01-04 -0.249368 -1.181939
2013-01-05 -0.711488  1.877233

In [38]:
df.iloc[[1, 2, 4], [0, 2]]

                   A         C
2013-01-02  0.286185 -1.974256
2013-01-03  0.256183 -0.554919
2013-01-05 -0.711488  1.588882

In [40]:
df.iloc[1:3, :]

                   A         B         C         D
2013-01-02  0.286185  0.612552 -1.974256  0.290884
2013-01-03  0.256183 -0.606892 -0.554919 -0.595412

In [41]:
df.iloc[:, 1:3]

                   B         C
2013-01-01 -0.258090  2.036218
2013-01-02  0.612552 -1.974256
2013-01-03 -0.606892 -0.554919
2013-01-04 -1.181939  0.086883
2013-01-05  1.877233  1.588882
2013-01-06 -0.199519 -0.487125

In [42]:
## Importer pandas et les dataset user_device.csv, user_usage.csv et android_devices.csv

In [49]:
Udevice = pd.read_csv("user_device.csv")
Uusage = pd.read_csv("user_usage.csv")
Adevice = pd.read_csv("android_devices.csv")

In [50]:
## Importer les dataset & renommer la colonne Branding du dataset android_devices.csv

In [52]:
print("before change \n {}".format(Adevice))
Adevice.rename(columns={"Retail Branding": "test"})

before change
       Retail Branding Marketing Name       Device                      Model
0                 NaN            NaN       AD681H  Smartfren Andromax AD681H
1                 NaN            NaN        FJL21                      FJL21
2                 NaN            NaN          T31              Panasonic T31
3                 NaN            NaN     hws7721g         MediaPad 7 Youth 2
4                  3Q        OC1020A      OC1020A                    OC1020A
...               ...            ...          ...                        ...
14541           pendo    PNDPP44QC10  PNDPP44QC10                PNDPP44QC10
14542           pendo     PNDPP44QC7   PNDPP44QC7                 PNDPP44QC7
14543      sugar_aums         QPOINT        QPI-1                      QPI-1
14544       tecmobile       OmnisOne     OmnisOne                  Omnis One
14545           ucall          EASY1        EASY1                      EASY1

[14546 rows x 4 columns]

             test Marketing Name       Device                      Model
0             NaN            NaN       AD681H  Smartfren Andromax AD681H
1             NaN            NaN        FJL21                      FJL21
2             NaN            NaN          T31              Panasonic T31
3             NaN            NaN     hws7721g         MediaPad 7 Youth 2
4              3Q        OC1020A      OC1020A                    OC1020A
...           ...            ...          ...                        ...
14541       pendo    PNDPP44QC10  PNDPP44QC10                PNDPP44QC10
14542       pendo     PNDPP44QC7   PNDPP44QC7                 PNDPP44QC7
14543  sugar_aums         QPOINT        QPI-1                      QPI-1
14544   tecmobile       OmnisOne     OmnisOne                  Omnis One
14545       ucall          EASY1        EASY1                      EASY1

[14546 rows x 4 columns]

In [53]:
## Afficher les dataset

In [57]:
Uusage.head(5)
Udevice.head(5)
Adevice.head(10)

,Retail Branding,Marketing Name,Device,Model
0,NaN,NaN,AD681H,Smartfren Andromax AD681H
1,NaN,NaN,FJL21,FJL21
2,NaN,NaN,T31,Panasonic T31
3,NaN,NaN,hws7721g,MediaPad 7 Youth 2
4,3Q,OC1020A,OC1020A,OC1020A
5,7Eleven,IN265,IN265,IN265
6,A.O.I. ELECTRONICS FACTORY,A.O.I.,TR10CS1_11,TR10CS1
7,AG Mobile,AG BOOST 2,BOOST2,E4010
8,AG Mobile,AG Flair,AG_Flair,Flair
9,AG Mobile,AG Go Tab Access 2,AG_Go_Tab_Access_2,AG_Go_Tab_Access_2

In [55]:
## Premier merge

   use_id  user_id platform  platform_version     device  use_type_id
0   22782    26980      ios              10.2  iPhone7,2            2
1   22783    29628  android               6.0    Nexus 5            3
2   22784    28473  android               5.1   SM-G903F            1
3   22785    15200      ios              10.2  iPhone7,2            3
4   22786    28239  android               6.0  ONE E1003            1

In [58]:
Uusage.merge(Udevice)

,outgoing_mins_per_month,outgoing_sms_per_month,monthly_mb,use_id,user_id,platform,platform_version,device,use_type_id
0,21.97,4.82,1557.33,22787,12921,android,4.3,GT-I9505,1
1,1710.08,136.88,7267.55,22788,28714,android,6.0,SM-G930F,1
2,1710.08,136.88,7267.55,22789,28714,android,6.0,SM-G930F,1
3,94.46,35.17,519.12,22790,29592,android,5.1,D2303,1
4,71.59,79.26,1557.33,22792,28217,android,5.1,SM-G361F,1
...,...,...,...,...,...,...,...,...,...
154,198.59,90.49,5191.12,23043,28953,android,6.0,SM-G900F,1
155,198.59,90.49,3114.67,23044,28953,android,6.0,SM-G900F,1
156,106.65,82.13,5191.12,23046,29454,android,6.0,Moto G (4),1
157,344.53,20.53,519.12,23049,29725,android,6.0,SM-G900F,1
158,42.75,46.83,5191.12,23053,20257,android,5.1,Vodafone Smart ultra 6,1